# 原子

道耳吞原子說：

1. 元素由原子組成，相同元素的原子完全一樣。
2. 化合物由兩種以上原子組成，其組成元素的原子數目呈簡單整數比。
3. 化學反應代表原子分離後重新排列組合，原子數目類型不變。

1890: 用陰極射線管的研究

湯木生 (Joseph John Thomson, 1856~1940) ：用陰極射線管測得電子的荷質比為  1.76e8 C/g

密立根 (Robert Andrews Millikan, 1868~1953)：用油滴實驗導出電子電荷為 1.6022e-19 C 

結合『荷質比』和『電子電荷』可求得電子的質量為 9.10e-28 g

1895 侖琴 (Wilhelm Konrad Rontgen, 1845~1923) 發現陰極射線管發出不受磁場偏折的 X 射線，因此推定不帶電荷。

貝克勒 (Antoine Henri Becquerel, 1852~1908) 研究螢光性質時發現底片放在鈾化物旁會曝光變黑，同樣也是不受磁場偏折，且為自發放射，後來其學生居禮夫人 (Marie Curie, 1867~1934) 稱此為放射性 （radioactivity)。後來將這些設限放在電場中發現又可分為三種，包含帶正電會偏向負極的 alpha 設線，帶負電會偏向正極的 beta 射線，還有不會偏向不帶電的 gamma 射線。

1900 年代，科學家實驗發現原子為值電中性，因此必然有等數目的正負電荷。於是湯木生提出布丁模型 (電子埋入正電球中）。後來 1910 年拉賽福 (Rrnest Rutherford, 1871~1937) 研究團隊用 alpha 粒子撞擊金箔發現大部分的 alpha 粒子都穿透金箔並且沒有偏折，但少數粒子大角度偏折甚至反彈，因而提出太陽系模型。

後來的實驗又測出質子質量為 1.673e-24 g，約為電子的 1840 倍。

但是拉賽福的原子模型引發一個問題，氫原子只有一個質子，氦原子有兩個質子，但是兩者質量比卻不是 1:2 ，而是 1:4 。

後來查兌克 （James Chadwick , 1891~1972) 用 alpha 粒子撞擊鈹箔，結果撞出第三種粒子，該粒子為電中性，於是稱之為中子 (neutrons)。

同位素 (isotopes) ： 質子數相同，但中子數不同的元素 （質量數 M=質子數 P+中子數 N)，可以寫為 $_P^M X$ ，其中 A 為質量數。 (例如：氫=質子 1+中子 0 = $_1^1  H$ | 氘=質子 1+中子 1 $_1^2 H$ | 氚=質子 1+中子 2 = $_1^3  H$)

後來門得列夫將元素排列成周期表，請參考下列連結。

* [維基百科:元素週期表](http://zh.wikipedia.org/wiki/%E5%85%83%E7%B4%A0%E5%91%A8%E6%9C%9F%E8%A1%A8)

