# 遺傳密碼 

* [遺傳密碼](http://zh.wikipedia.org/wiki/%E9%81%97%E4%BC%A0%E5%AF%86%E7%A0%81)

蛋白質由 20 種胺基酸組成，和 DNA (RNA) 之間有 3 對 1 的關係，亦即 3 個 DNA 分子對應一個蛋白質分子，這種對應關係稱為遺傳密碼。


| 蛋白質 | 簡稱 | 對應DNA | 蛋白質 | 簡稱 | 對應DNA | 
|--------|------|---------|--------|------|---------| 
| Ala	| A	| GCN	      | Leu	| L	| UUR, CUN  | 
| Arg	| R	| CGN, AGR	| Lys	| K	| AAR       | 
| Asn	| N	| AAY	      | Met	| M	| AUG       | 
| Asp	| D	| GAY	      | Phe	| F	| UUY       | 
| Cys	| C	| UGY	      | Pro	| P	| CCN       | 
| Gln	| Q	| CAR	      | Ser	| S	| UCN, AGY  | 
| Glu	| E	| GAR	      | Thr	| T	| ACN       | 
| Gly	| G	| GGN	      | Trp	| W	| UGG       | 
| His	| H	| CAY	      | Tyr	| Y	| UAY       | 
| Ile	| I	| AUY, AUA	| Val	| V	| GUN       | 
| 起始| 	| AUG	      | 終止| 	| UAR, UGA  | 

## 起始和終止密碼子

蛋白質的轉譯從初始化密碼子（起始密碼子）開始，但亦需要適當的初始化序列和起始因數才能使mRNA和核糖體結合。最常見的起始密碼子為AUG，其同時編碼的胺基酸在細菌為甲醯甲硫氨酸，在真核生物為甲硫氨酸，但在個別情況其它一些密碼子也具有起始的功能。

在經典遺傳學中，終止密碼子各有名稱：UAG為琥珀（amber），UGA為蛋白石（opal），UAA為赭石（ochre）。這些名稱來源於最初發現到這些終止密碼子的基因的名稱。終止密碼子使核醣體和釋放因數結合，使多肽從核醣體分離而結束轉譯的程式。另外，在哺乳動物的線粒體中，AGA和AGG也充當終止密碼子。

## 簡並性

大部分密碼子具有簡並性，即兩個或者多個密碼子編碼同一胺基酸。簡並的密碼子通常只有第三位元堿基不同，例如，GAA和GAG都編碼穀氨醯胺。如果不管密碼子的第三位元為哪種核苷酸，都編碼同一種胺基酸，則稱之為四重簡並；如果第三位有四種可能的核苷酸之中的兩種，而且編碼同一種胺基酸，則稱之為二重簡並，一般第三位上兩種等價的核苷酸同為嘌呤（A/G）或者嘧啶（C/T）。只有兩種胺基酸僅由一個密碼子編碼，一個是甲硫氨酸，由AUG編碼，同時也是起始密碼子；另一個是色氨酸，由UGG編碼。

### 閱讀框

「密碼子」是由閱讀的起始位點決定的。例如，一段序列GGGAAACCC，如果由第一個位置開始讀，包括3個密碼子GGG，AAA和CCC。如果從第二位開始讀，包括GGA和AAC（忽略不完整的密碼子）。如果從第三位開始讀，則為GAA和ACC。故此每段序列都可以分為三個閱讀框，每個都能產生不同的胺基酸序列（在上例中，相應為Gly-Lys-Pro，Gly-Asp，和Glu-Thr）。而因為DNA的雙螺旋結構，每段DNA實際上有六個閱讀框。 實際的框架是由起始密碼子確定，通常是mRNA序列上第一個出現的AUG。

破壞閱讀框架的變異（例如，插入或刪除1個或2個核苷酸）稱為閱讀框變異，通常會嚴重影響到蛋白質的功能，故此並不常見，因為他們通常不能在演化中存活下來。

### 非標準的遺傳密碼
雖然遺傳密碼在不同生命之間有很強的一致性，但亦存在非標準的遺傳密碼。在有「細胞能量工廠」之稱的線粒體中，便有和標準遺傳密碼數個相異的之處，甚至不同生物的線粒體有不同的遺傳密碼。支原體會把UGA轉譯為色氨酸。纖毛蟲則把UAG（有時候還有UAA）轉譯為穀氨醯胺（一些綠藻也有同樣現象），或把UGA轉譯為半胱氨酸。一些酵母會把GUG轉譯為絲氨酸。在一些罕見情況，一些蛋白質會有AUG以外的起始密碼子。


### 遺傳密碼的起源

除了少數的不同之外，地球上已知生物的遺傳密碼均非常接近；因此根據演化論，遺傳密碼應在生命歷史中很早期就出現。現有的證據表明遺傳密碼的設定並非是隨機的結果，對此有以下的可能解釋:

最近一項研究顯示，一些胺基酸與它們相對應的密碼子有選擇性的化學結合力，這顯示現在複雜的蛋白質製造過程可能並非一早存在，最初的蛋白質可能是直接在核酸上形成。

原始的遺傳密碼可能比今天簡單得多，隨著生命演化製造出新的胺基酸再被利用而令遺傳密碼變得複雜。雖然不少證據證明這觀點，但詳細的演化過程仍在探索之中。

經過自然選擇，現時的遺傳密碼減低了突變造成的不良影響。


